app/controllers/video_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."twitter_screen_name" = $1  ORDER BY "artists"."id" ASC LIMIT 1  [["twitter_screen_name", "AnthonyEdwardsj"]]
INSERT INTO "artists" ("twitter_id", "twitter_screen_name", "twitter_img_url", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
SELECT  "artists".* FROM "artists" WHERE "artists"."twitter_id" = $1  ORDER BY "artists"."id" ASC LIMIT 1  [["twitter_id", "30777203"]]
INSERT INTO "roles" ("label", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["label", "d"], ["created_at", "2016-03-05 17:13:50.002670"], ["updated_at", "2016-03-05 17:13:50.002670"]]
SELECT  "roles".* FROM "roles" WHERE "roles"."label" = $1  ORDER BY "roles"."id" ASC LIMIT 1  [["label", "d"]]
INSERT INTO "artist_videos" ("artist_id", "video_id", "role_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["artist_id", 21], ["video_id", 75], ["role_id", 10], ["created_at", "2016-03-05 17:13:50.013964"], ["updated_at", "2016-03-05 17:13:50.013964"]]
INSERT INTO "videos" ("url", "yt_title", "yt_description", "yt_author", "yt_pub_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
SELECT  "artist_videos".* FROM "artist_videos" WHERE "artist_videos"."artist_id" = 21 AND "artist_videos"."video_id" = 75 AND "artist_videos"."role_id" = 10  ORDER BY "artist_videos"."id" ASC LIMIT 1
---
  def tag
    dancer_list = params[:dancer_tags].first.split(",")
    @video.dancer_list.add(dancer_list, parse: true)
    dancer_list.each do | dancer |
      if params[:handle_type]['0'] == 'twitter'
        @artist = Artist.where(twitter_screen_name: dancer).first
        begin
          @artist ||=@client.user(dancer.strip.downcase)
          if @artist.class.name != "Artist"
            @artist = Artist.where(
                                 twitter_id: @artist.id,
                                ).first_or_create do |art|
              art.twitter_screen_name = @artist.screen_name
              art.twitter_img_url = @artist.profile_image_url.to_s
              art.name = @artist.name
            end
          end
          @role = Role.where(label: params[:artist_role]).first_or_create
          ArtistVideo.where(artist: @artist, video: @video, role: @role).first_or_create

INSERT INTO "videos" ("url", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["url", "ZYkmsFBcHxk"], ["created_at", "2016-02-28 15:32:01.093868"], ["updated_at", "2016-02-28 15:32:01.093868"]]
SELECT  "videos".* FROM "videos" WHERE "videos"."url" = $1  ORDER BY "videos"."id" ASC LIMIT 1  [["url", "ZYkmsFBcHxk"]]
UPDATE "videos" SET "yt_count" = $1, "yt_title" = $2, "yt_description" = $3, "yt_author" = $4, "yt_pub_date" = $5, "updated_at" = $6 WHERE "videos"."id" = $7
---
  def create
    @video = Video.where(url: video_params[:url].split('v=').second).first_or_create
    @new_video = Video.new
    if @video.save

SELECT  "videos".* FROM "videos" WHERE "videos"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "artists".* FROM "artists" INNER JOIN "artist_videos" ON "artists"."id" = "artist_videos"."artist_id" WHERE "artist_videos"."video_id" = $1 AND 1=0  [["video_id", 75]]
---
  def load_video
    @video = Video.find(params[:video_id] || params[:id])
    @video.set_yt_data
    @_artists = []
    @artist_videos = @video.artist_videos.includes(:artist)